test/performance/benchmarks/real-traffic-test/results/kube-manager/10_seconds-5_interfering/2026-02-23_21-35-31/vegeta_metrics.txt
=== Real Traffic Test Results ===


== Test Configuration ==

Services: 10
RPS: 50
Duration: 1m0s
Min Latency: 0s
Max Latency: 0s
Min Startup Latency: 0s
Max Startup Latency: 0s
Min Payload Size (bytes): 10000
Max Payload Size (bytes): 10000
Critical Test: false
Sources of Interference: 5
Interfering Namespace: interference
Bucket Node: dessertw3


== Test Results ==

= Aggregated Results =

Requests      [total, rate, throughput]         3000, 50.02, 50.01
Duration      [total, attack, wait]             59.988s, 59.98s, 7.976ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.08ms, 115.098ms, 8.192ms, 41.469ms, 490.471ms, 2.893s, 4.097s
Bytes In      [total, mean]                     29133019, 9711.01
Bytes Out     [total, mean]                     30000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3000  
Error Set:

= Per-Service Results =

# Service: perftest-0

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 6.273ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.08ms, 90.245ms, 7.126ms, 12.591ms, 189.771ms, 2.523s, 3.064s
Bytes In      [total, mean]                     2914539, 9715.13
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-1

Requests      [total, rate, throughput]         300, 5.02, 5.01
Duration      [total, attack, wait]             59.829s, 59.8s, 28.998ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.312ms, 109.282ms, 9.596ms, 48.579ms, 365.508ms, 2.743s, 3.233s
Bytes In      [total, mean]                     2913977, 9713.26
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-2

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.815s, 59.799s, 15.2ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.192ms, 101.378ms, 9.548ms, 53.743ms, 299.61ms, 2.596s, 3.004s
Bytes In      [total, mean]                     2912634, 9708.78
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-3

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 6.393ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.164ms, 84.663ms, 7.676ms, 14.156ms, 75.794ms, 2.414s, 3.006s
Bytes In      [total, mean]                     2914271, 9714.24
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-4

Requests      [total, rate, throughput]         300, 5.02, 5.01
Duration      [total, attack, wait]             59.832s, 59.799s, 32.512ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.484ms, 108.935ms, 9.254ms, 59.124ms, 321.715ms, 2.737s, 3.219s
Bytes In      [total, mean]                     2913139, 9710.46
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-5

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.807s, 59.799s, 8.08ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.122ms, 99.609ms, 7.113ms, 12.101ms, 336.332ms, 2.743s, 3.189s
Bytes In      [total, mean]                     2912698, 9708.99
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-6

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.81s, 59.8s, 9.117ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.29ms, 151.481ms, 7.955ms, 13.589ms, 1.156s, 3.562s, 3.978s
Bytes In      [total, mean]                     2911471, 9704.90
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-7

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.814s, 59.8s, 14ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.687ms, 96.601ms, 9.773ms, 55.359ms, 194.402ms, 2.514s, 2.968s
Bytes In      [total, mean]                     2913810, 9712.70
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-8

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.809s, 59.8s, 9.39ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.36ms, 166.787ms, 10.784ms, 85.75ms, 1.231s, 3.646s, 4.097s
Bytes In      [total, mean]                     2912764, 9709.21
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-9

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.808s, 59.8s, 7.976ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.39ms, 141.997ms, 7.649ms, 13.233ms, 1.055s, 3.373s, 3.797s
Bytes In      [total, mean]                     2913716, 9712.39
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set: